/**Решите систему линейных алгебраических уравнений методом простых итераций  ( ) в соответствии с вариантом.
 *  Предварительно необходимо привести  матрицу к виду, удобному для итераций.
 * Багдя Павел, 1 Вариант
 * Res:  [
  2.044
0.083
1.045
-0.656
]
 * */

let A = [
  [-0.77, -0.04, 0.21, -0.18],
  [0.45, -1.23, 0.06, 0],
  [0.25, 0.34, -1.11, 0],
  [0.05, -0.26, 0.34, -1.12],
];
let B = [-1.24, 0.88, -0.62, 1.17];

let eps = 0.001;
let x = [],
  n = A.length;

//Упрощаем матрицу и вектор по формулам
for (let i = 0; i < n; i++) {
  let k = A[i][i];
  for (let j = 0; j < n; j++) {
    A[i][j] /= -k;
  }
  A[i][i] = 0;
  B[i] /= k;
}

//Создаем 0 приближение
x = [...B];
let sum = x.reduce((acc, b) => acc + b, 0);

let temp = sum + 2 * eps;
//Начинаем итерации по приближению к ответу
while (Math.abs(x.reduce((acc, b) => acc + b, 0) - temp) > eps) {
  temp = x.reduce((acc, b) => acc + b, 0);
  let t = [];
  for (let i = 0; i < n; i++) {
    let sum = 0;
    for (let j = 0; j < n; j++) {
      sum += x[j] * A[i][j];
    }
    t[i] = sum + B[i];
  }
  x = [...t];
}
let acc = 10 ** (String(eps).length - 2);
for (let i of x) {
  console.log(Math.round(i * acc) / acc);
}
