/**Вариант 1, Багдя Павел
 * Решите систему линейных алгебраических уравнений методом прогонки E=0.001 в соответствии с вариантом.
 *
 * Res: [0.466, 1.601, 1.054]
 */

let A = [
  [3.14, -0.12, 0],
  [-0.12, 2.32, -1.45],
  [0, -1.45, 5.18],
];
let B = [1.27, 2.13, 3.14];
let e = 0.001;
let E = 10 ** (String(e).length - 2);

function solve(a, b) {
  let n = a.length;
  let x = [];
  let v = [];
  let u = [];
  //Находим первые прогоночные коэффициенты
  v[0] = a[0][1] / -a[0][0];
  u[0] = -b[0] / -a[0][0];
  //Находим n-ые прогоночные коэфициенты
  for (let i = 1; i < n; i++) {
    v[i] = a[i][i + 1] / (-a[i][i] - a[i][i - 1] * v[i - 1]);
    u[i] =
      (a[i][i - 1] * u[i - 1] - b[i]) / (-a[i][i] - a[i][i - 1] * v[i - 1]);
  }
  //Находим столбец ответов
  x[n - 1] = Math.round(u[n - 1] * E) / E;
  for (let i = n - 1; i > 0; i--) {
    x[i - 1] = Math.round((v[i - 1] * x[i] + u[i - 1]) * E) / E;
  }
  return x;
}
console.log(solve(A, B));
